/**
 *************************************************************************************
 * 版权所有 (C) 2023, 南京创芯慧联技术有限公司
 * 保留所有权利。
 *
 * @file
 *
 * @brief
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-08-01     ict team          创建
  ************************************************************************************
  */

 /************************************************************************************
  *                                 头文件
  ************************************************************************************/
#include "os.h"
#include "app_pseudo_at_device.h"

#define ZLOG_TARGET   "at_tool"
#include "zlog.h"
/************************************************************************************
 *                                 内部函数声明
 ************************************************************************************/


/************************************************************************************
 *                                 宏定义
 ************************************************************************************/


/************************************************************************************
 *                                 类型定义
 ************************************************************************************/


/************************************************************************************
 *                                 全局变量定义
 ************************************************************************************/


/************************************************************************************
 *                                 内部函数定义
 ************************************************************************************/



/************************************************************************************
 *                                 函数定义
 ************************************************************************************/


#ifdef OS_USING_SHELL
#include <stdlib.h>
#include "nr_micro_shell.h"

void at_recv_callback(const char *data, uint32_t dataLen)
{
    shell_printf("at recv: %*.s\r\n", dataLen, data);
}

static void usage(char * cmd)
{
    shell_printf("%s at_cmd \r\n", cmd);
    shell_printf("eg. %s AT+CMGMR \r\n", cmd);

    return;
}

void SHELL_at_tool(char argc, char **argv)
{
    static int inited = 0;
    char *at_cmd = NULL;
    int at_cmd_len = 0;

    if(argc == 2)
    {
        shell_printf("at send: %s\r\n", argv[1]);
        if(inited == 0)
        {
            APP_PseudoATDevice_Register_Notify(at_recv_callback);
            APP_PseudoATDevice_Initialize();
            inited = 1;
        }

        //APP_PseudoATDevice_Write(argv[1], strlen(argv[1]));
        //APP_PseudoATDevice_Write("\r\n", 2);
        at_cmd = osMalloc(strlen(argv[1]) + 10);
        if(at_cmd)
        {
            at_cmd_len = snprintf(at_cmd, strlen(argv[1]) + 10, "%s\r\n", argv[1]);
            APP_PseudoATDevice_Write(at_cmd, at_cmd_len);
            osFree(at_cmd);
        }
        else
        {
            shell_printf("osMalloc fail! \r\n");
        }
    }
    else
    {
        usage(argv[0]);
    }
}
NR_SHELL_CMD_EXPORT(at_tool, SHELL_at_tool);
#endif