/**
 *************************************************************************************
 * 版权所有 (C) 2023, 南京创芯慧联技术有限公司
 * 保留所有权利。
 *
 * @file
 *
 * @brief
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-08-28     ict team          创建
 ************************************************************************************
 */

#ifndef __ONENET_OTA_TOKEN_H__
#define __ONENET_OTA_TOKEN_H__

#ifdef __cplusplus
extern "C" {
#endif

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/


/************************************************************************************
 *                                 类型定义
 ************************************************************************************/


/************************************************************************************
 *                                 函数声明
 ************************************************************************************/
/**
 ***********************************************************************************************
 * @brief           1. Token 的签名生成算法为:
                    sign = base64(hmac_<method>(base64decode(accessKey), utf-8(StringForSignature)))
 *                  2. StringForSignature组成:
 *                  StringForSignature = et + '\n' + method + '\n' + res+ '\n' + version
 *
 * @param[in]       res            格式为: userid/xxx 或 userid/xxx 或 products/xxx/devices/xxx
 * @param[in]       et             UNIX时间戳, 从1970年1月1日开始所经过的秒数. 转换成北京时间必须比当前
 *                                 系统时间更大. 1836152085代表北京时间2028-03-09 02:14:45
 * @param[in]       accessKey      对应的秘钥(用户秘钥或产品秘钥或设备秘钥). 秘钥是唯一的
 * @param[in]       method         签名方法. 有 md5, sha1, sha256
 *
 * @param[out]      authorization  生成的安全秘钥鉴权
 *
 * @return          osOK: Token 计算生成成功. 其它: Token 计算生成失败
 ***********************************************************************************************
*/
int32_t OTA_TokenGenerate(const char *res, uint32_t et, const char *accessKey, uint8_t method, char *authorization);

#ifdef __cplusplus
}
#endif
#endif

