/**
 *************************************************************************************
 * 版权所有 (C) 2023, 南京创芯慧联技术有限公司
 * 保留所有权利。
 *
 * @file
 *
 * @brief
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-08-28     ict team          创建
 ************************************************************************************
 */

#ifndef __ONENET_OTA_UPGRADE_H__
#define __ONENET_OTA_UPGRADE_H__

#ifdef __cplusplus
extern "C" {
#endif

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/


/************************************************************************************
 *                                 类型定义
 ************************************************************************************/


/************************************************************************************
 *                                 函数声明
 ************************************************************************************/
int32_t OTA_UpgradeFirmwareOffsetGet(char *url, uint8_t force, char *pathName, uint32_t firmwareSize);
int32_t OTA_UpgradeSaveFirmware(const void *buf, uint32_t len, char *pathName);
int32_t OTA_UpgradeFirmwareSizeCheck(int32_t totalSize, char *pathName);
int32_t OTA_UpgradeFirmware(char *pathName);


#ifdef __cplusplus
}
#endif
#endif

