/**
 *************************************************************************************
 * 版权所有 (C) 2023, 南京创芯慧联技术有限公司
 * 保留所有权利。
 *
 * @file        nvparam_customcfg.h
 *
 * @brief       客制 NV 顶层定义.
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-04-21     ict team          创建
 ************************************************************************************
 */


#ifndef NVPARAM_CUSTOMCFG_LAYOUT_H
#define NVPARAM_CUSTOMCFG_LAYOUT_H

/************************************************************************************
 *                                 头文件
 ************************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <nv/nvparam_config.h>


/************************************************************************************
 *                                 配置开关
 ************************************************************************************/


/************************************************************************************
 *                                 宏定义
 ************************************************************************************/


/************************************************************************************
 *                                 类型定义
 ************************************************************************************/
typedef struct {
    uint16_t    cfg1;
    uint8_t     cfg2[2];
}NV_DemoConfig;


/**
 * @struct NV_CustomConfig
 * @brief 客制 NV 空间布局定义结构体, 在此顺序增加 NV 子项
 */
typedef struct {
    union {
    NV_DemoConfig   demoCfg;
    uint8_t         demoCfgArea[8];
    };
}NV_CustomConfig;

/************************************************************************************
 *                                 函数定义
 ************************************************************************************/
/**
 * 编译检测函数
 */
static void NV_CheckCustomConfigSize(void)
{
    BUILD_BUG_ON(MEMBER_SIZE(NV_CustomConfig, demoCfg) > MEMBER_SIZE(NV_CustomConfig, demoCfgArea));
}

/**
 * NV 默认值实现
 */
static void NV_CustomConfigDefault(NV_CustomConfig *cfg)
{
    cfg->demoCfg.cfg1 = 0x00;
    cfg->demoCfg.cfg2[0] = 0x55;
    cfg->demoCfg.cfg2[1] = 0xAA;
}

#endif /* NVPARAM_CUSTOMCFG_LAYOUT_H */
