/**
 *************************************************************************************
 * 版权所有 (C) 2023, 南京创芯慧联技术有限公司
 * 保留所有权利。
 *
 * @file
 *
 * @brief
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-08-01     ict team          创建
 ************************************************************************************
 */


#ifndef __APP_PSEUDO_AT_DEVICE_H__
#define __APP_PSEUDO_AT_DEVICE_H__


/************************************************************************************
 *                                 头文件
 ************************************************************************************/
#include <stdint.h>


#ifdef __cplusplus
extern "C" {
#endif

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/


/************************************************************************************
 *                                 类型定义
 ************************************************************************************/
typedef void (*APP_PseudoATDevice_Notify)(const char *data, uint32_t dataLen);

/************************************************************************************
 *                                 函数声明
 ************************************************************************************/
/**
 ************************************************************************************
 *   AT虚拟设备初始化
 *   实际是打开一个AT框架的通道
 *   在向AT虚拟设备写入数据前，需要初始化AT虚拟设备
 ************************************************************************************
*/
int32_t APP_PseudoATDevice_Initialize(void);


/**
 ************************************************************************************
 *   AT虚拟设备去初始化
 *   实际是关闭AT框架的通道
 *   当确认不需要使用AT虚拟设备时，可以去注册AT虚拟设备
 ************************************************************************************
*/
int32_t APP_PseudoATDevice_Uninitialize(void);


/**
 ************************************************************************************
 *   注册AT虚拟设备通知回调
 *   当AT虚拟设备有数据要上报时会调用这个回调
 ************************************************************************************
*/
void APP_PseudoATDevice_Register_Notify(APP_PseudoATDevice_Notify notify);

/***************************
 *   向AT虚拟设备写入数据，即向AT框架发送命令
 *
 *   注意：
 *   由于AT框架任务优先级高，发送命令后会立即执行，所以APP_PseudoATDevice_Read有可能会立即被调用
 *   在APP_PseudoATDevice_Read中依赖的状态需要在调用AT_DeviceReceived前设置
 */
int32_t APP_PseudoATDevice_Write(char* data, uint32_t dataLen);


#ifdef __cplusplus
}
#endif
#endif//__APP_PSEUDO_AT_DEVICE_H__


