/**
 *************************************************************************************
 * 版权所有 (C) 2023, 南京创芯慧联技术有限公司
 * 保留所有权利。
 *
 * @file        drv_input.h
 *
 * @brief       输入设备.
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-05-11     ICT Team         创建
 ************************************************************************************
 */

#ifndef _DRV_INPUT_H_
#define _DRV_INPUT_H_

/************************************************************************************
 *                                 头文件
 ************************************************************************************/
#include <os.h>
#include "lvgl.h"

/**
 * @addtogroup Input
 */

/**@{*/

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/

/************************************************************************************
 *                                 类型定义
 ************************************************************************************/
/**
 * @brief 输入设备类型
 */
typedef enum {
    INPUT_TYPE_TOUCH,
    INPUT_TYPE_KEYPAD,
    INPUT_TYPE_BUTTON,
} InputType_t;

/**
 * @brief 显示设备
 */
typedef struct InputDevice
{
    InputType_t type;
    
    int (*init)(struct InputDevice *pDev);
    void (*read)(struct InputDevice *pDev, lv_indev_data_t *data);
    int (*deinit)(struct InputDevice *pDev);
} InputDevice_t;

typedef struct
{
    InputDevice_t inputDev;
    uint16_t      touchWidth;
    uint16_t      touchHeight;
} InputTouch_t;

/************************************************************************************
 *                                 函数声明
 ************************************************************************************/

/**
 ************************************************************************************
 * @brief           获取模拟器的输入设备
 *
 * @return          获取LCD操作设备.
 * @retval          DispDevice_t                      
 ************************************************************************************
 */
InputDevice_t * InputEmu_GetTouchDevice(void);
InputDevice_t * InputEmu_GetKeypadDevice(void);
InputDevice_t * InputEmu_GetButtonDevice(void);

/**
 ************************************************************************************
 * @brief           获取某厂家的的输入设备
 *
 * @return          获取输入设备.
 * @retval          InputDevice_t                      
 ************************************************************************************
 */
InputDevice_t * InputXxx_GetDevice(void);


#endif /* End of _DRV_DISP_H_*/
/** @} */
