/**
 *************************************************************************************
 * 版权所有 (C) 2023, 南京创芯慧联技术有限公司
 * 保留所有权利。
 *
 * @file
 *
 * @brief
 *
 * @revision
 *
 * 日期           作者              修改内容
 * 2023-08-01     ict team          创建
 ************************************************************************************
 */

#ifndef __TTS_API_H__
#define __TTS_API_H__

/************************************************************************************
 *                                 头文件
 ************************************************************************************/
#include "os.h"
#include "stdbool.h"

#ifdef __cplusplus
extern "C" {
#endif

/************************************************************************************
 *                                 宏定义
 ************************************************************************************/

/************************************************************************************
 *                                 类型定义
 ************************************************************************************/
typedef enum{
    TTS_PLAY_EVENT_START = 0, //<    开始处理
    TTS_PLAY_EVENT_STOP,      //<    停止处理
    TTS_PLAY_EVENT_END,       //<    正常处理完成
    TTS_PLAY_EVENT_ERROR      //<    处理出错
} TTS_PlayEvent;              //<    播放事件

typedef enum{
    TTS_PLAY_TEXTCODE_UTF8 = 0,
    TTS_PLAY_TEXTCODE_UTF16LE,
    TTS_PLAY_TEXTCODE_UTF16BE,
    TTS_PLAY_TEXTCODE_GBK
} TTS_PlayTextCode;        //<    文本编码格式

typedef enum{
    TTS_PLAY_PATH_NONE = 0,
    TTS_PLAY_PATH_CODEC, //<   使用codec播放, 外置codec
    TTS_PLAY_PATH_DAC,   //<   使用DAC播放, 内置codec
} TTS_PlayPath;               //    语音播放通道

typedef struct{
    int32_t volume;      //<   音量 -32768 ~ 32767
    int32_t speed;       //<   语速 -32768 ~ 32767
    uint32_t audioPath;  //<   音频通路配置 参考 TTS_PlayPath 定义
    int32_t codepage;    //<   字符编码, 参考 TTS_PlayTextCode 定义
    uint8_t *text;       //<   指向文本buf的指针
    uint32_t textsize;   //<   text中内容字节数
    void (*eventCB)(uint32_t eventID);  //<   事件回调函数 开始，停止，结束
} TTS_PlayParam;
/************************************************************************************
 *                                 函数声明
 ************************************************************************************/
/**
 ************************************************************************************
 * @brief           播放文本
 *
 * @param[in]       param                 播放参数
 *
 * @return osOK成功，其他失败
 * @note
 ************************************************************************************
*/
int32_t TTS_PlayStart(TTS_PlayParam *param);
/**
 ************************************************************************************
 * @brief           停止播放
 *
 * @param[in]       none
 *
 * @return osOK成功，其他失败
 * @note
 ************************************************************************************
*/
int32_t TTS_PlayStop(void);
/**
 ************************************************************************************
 * @brief           停止播放
 *
 * @param[in]       none
 *
 * @return true ： 正在播放  false : 没有播放
 * @note
 ************************************************************************************
*/
bool TTS_PlayIsBusy(void);

#ifdef __cplusplus
}
#endif
#endif//__TTS_API_H__


