-----------------------------------------------------------------------
-- Xmake script file
-- Copyright (C) 2023, Nanjing Innochip Technology Co.,Ltd.
-- All rights reserved.
--
-- @author      geanfeng
-- @file        xmake.lua
-----------------------------------------------------------------------

-----------------------------------------------------------------------
-- Configuration
-----------------------------------------------------------------------
local TARGET_NAME = "pcm_u_a"
-----------------------------------------------------------------------
-- Export global macro
-----------------------------------------------------------------------

-----------------------------------------------------------------------
-- Export global include directory
-----------------------------------------------------------------------

-----------------------------------------------------------------------
-- Compile options
-----------------------------------------------------------------------
option("pcm_u_a")
    -- 默认关闭
	set_default(false)
	set_showmenu(true)
	set_category("pcm_u_a")
	set_description("Enable or disable pcm_u_a function", "  =y|n")
option_end()

----------------------------------------------------------------------
-- Export global macro
-----------------------------------------------------------------------

-----------------------------------------------------------------------
-- Target
-----------------------------------------------------------------------
target(TARGET_NAME)
-- [don't edit] ---
	set_kind("static")
	add_deps("base")
    -- set_optimize("fastest")
	add_global_deps(TARGET_NAME)
-- [   end    ] ---
    add_srcfile("g711.c", {public = true})
    add_srcfile("g711_table.c", {public = true})
    add_global_includedirs(".")

	--对外SDK头文件
target_end()

